app/controllers/sessions_controller.rb

  def callback
    if session[:atoken].nil?
      atoken, asecret = $client.authorize_from_request(session[:rtoken], session[:rsecret], params[:oauth_verifier])
      session[:atoken] = atoken
      session[:asecret] = asecret
    else
      $client.authorize_from_access(session[:atoken], session[:asecret])
    end
    uri = URI($client.profile.site_standard_profile_request.url)
    linkedin_id = /&key=(\d+)/.match(uri.query)[1]
    user = User.find_by_linkedin_id(linkedin_id)
    User.create!(:linkedin_id => linkedin_id) if !user
---
SELECT "users".* FROM "users" WHERE "users"."linkedin_id" = 2158694 LIMIT 1
INSERT INTO "users" ("connection_id", "created_at", "linkedin_id", "secret", "token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["connection_id", nil], ["created_at", Sun, 04 Dec 2011 03:06:34 UTC +00:00], ["linkedin_id", 2158694], ["secret", nil], ["token", nil], ["updated_at", Sun, 04 Dec 2011 03:06:34 UTC +00:00]]